Repository: ashrafffathalla/taosel_user_APP
Catalog: lib/core/localization/app_*.arb
Languages: ar

# signIn
source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب

# addLicense
source: Add Licenses
ar: أضف رخصه القياده

# sendAgain
source: Didn't receive the code?
ar: لم تستلم الرمز؟

# sendAgain2
source: Send Code Again
ar: اعاده الارسال

source: Confirm Password
ar: تأكيد كلمة المرور

# selectCountry
source: Nationality
ar: الجنسيه

source: Booking Days :
ar: عدد ايام الحجز :

source: Choose from the list of additional services
ar: اختر من قائمة الخدمات الإضافية

source: Receive
ar: الاستلام

# fuel
source: gasoline difference
ar: فرق البزين

source: add ToCard
ar: اضافة الى السلة

# deliver
source: Delivery Charge
ar: رسوم التوصيل

source: Car Price
ar: سعر السيارة

source: Pay Details
ar: تفاصيل الدفع

source: Invoice
ar: الفاتوره

# missedDropOff
source: You’ve missed the drop-off time, please Continue to pay for the extra duration.
ar: لقد فاتك وقت التسليم ، يُرجى الاستمرار في الدفع مقابل المدة الإضافية.

# sameCard
source: we will use the same card you used to rent the car.
ar: سنستخدم نفس البطاقة التي استخدمتها لاستئجار السيارة.

source: Edit Personal Information
ar: تعديل المعلومات الشخصيه

# noTax
source: The customer has no financial obligations
ar: لا يوجد على العميل أي التزامات مالية

# editPassowrd
source: Edit password
ar: تعديل الرقم السري

source: Rented Car
ar: السيارة المؤجرة

source: Change Car
ar: تغيير السيارة

source: Enter Mobile Number
ar: أدخل رقم الجوال

# phoneNumber
source: Email Or Phone
ar: البريد أو رقم الهاتف

source: Full Name
ar: الاسم حسب الهويه

source: Password
ar: كلمة المرور

source: Email Address
ar: عنوان البريد الالكترونى

source: Skip
ar: تخطي

source: Forget Password?
ar: نسيت كلمة المرور ؟

# changePassword
source: Change Password Via SMS
ar: تغيير كلمة المرور من خلال رسالة نصية

# changePasswordDesc
source: Kindly Enter Your Phone
ar: يرجى إدخال رقم هاتفك

source: Send
ar: إرسال

source: OTP Code
ar: كود التحقق

# otpDesc
source: kindly enter your verification code
ar: يرجى إدخال رمز التحقق الخاص بك

source: Confirm
ar: تأكيد

source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetDesc
source: Kindly Enter Your New Password
ar: يرجى إدخال كلمة المرور الجديدة

# resetButton
source: Reset
ar: إعادة تعيين

# uploadedSuccessfully
source: successfully
ar: تم الرفع

# done
source: All Done
ar: تم بنجاح

# doneDesc
source: Password Reseted Successfully
ar: تمت إعادة تعيين كلمة المرور بنجاح

# doneButton
source: Login Now
ar: سجل الآن

# resetError
source: Oops
ar: إنتبه

# resetErrorDesc
source: Something Went Wrong
ar: هناك خطأ ما

# resetErrorButton
source: Go Back
ar: عودة

# enterValidCVV
source: Please Enter Valid CVV
ar: ادخل بيانات صالحة

source: Please Enter Valid Credit
ar: برجاء ادخال بطاقة صالحة

source: Please Enter Password
ar: برجاء ادخال كلمة المرور

# passwordNotMatching
source: Password Are Not Matching
ar: كلمة المرور غير متطابقة

# pleaseEnterNumberMinimum
source: Enter Number Minimum 9
ar: ادخال رقم الهاتف بحد ادني 9 ارقام

source: Please Enter Phone Number
ar: برجاء ادخال رقم الهاتف الجوال

source: Enter Valid Email
ar: برجاء ادخال بريد الكتروني صالح

source: Please enter email
ar: برجاء ادخال البرريد

source: Please enter name
ar: برجاء ادخال الاسم

# enterNameMiniChars
source: Please enter name minimum 5 characters
ar: برجاء ادخال اسم المستخدم بحد ادني 5 احرف

source: hello
ar: مرحبا

source: Usability
ar: سهل الاستخدام

# usabilitydesc
source: You Can Use Our App In The Easiest Way Ever With Awesome Interface Anytime You Want.
ar: يمكنك استخدام تطبيقنا بأسهل طريقة على الإطلاق مع واجهة استخدام رائعة في أي وقت تريده.

source: Time
ar: الوقت

# timedesc
source: We Value The Importance Of Time To You, Rent Your Car In A Few Seconds.
ar: نقدر أهمية الوقت بالنسبة لكم ، بإمكانك استئجار سيارتك في بضع ثوانٍ.

source: Our Cars
ar: سياراتنا

source: Car Details
ar: تفاصيل السيارة

# ourcarsdesc
source: We Offer The Best Collection Of Cars Which Are Ready For You Anytime.
ar: نقدم لكم أفضل مجموعة من السيارات الجاهزة دائما في أي وقت.

source: Change Languagh
ar: تغير اللغة

source: My Account
ar: حسابي

source: Account Info
ar: معلومات الحساب

source: My Wallet
ar: محفظتي

source: My Booking
ar: حجوزاتي

source: My Orders
ar: طلباتي

source: Pick Up
ar: استلام السيارة

source: Drop Off
ar: تسليم السيارة

source: About Us
ar: نبذة عنا

source: Our Services
ar: خدماتنا

source: Who We Are
ar: من نحن؟

source: How App Works?
ar: كيف يعمل التطبيق؟

source: Privacy Policy
ar: سياسة الخصوصية

source: Support
ar: الدعم

source: Contact Us
ar: تواصل معنا

source: FAQ
ar: الأسئلة الشائعة

source: Settings
ar: الاعدادات

source: Log Out
ar: تسجيل خروج

# homeTitle
source: Get Car Into Your Pocket
ar: احصل على سيارتك في جيبك الخاص

# pickUpLocation
source: Choose Pick Up Location
ar: اختر موقع الاستلام

# sameLocation
source: Deliver To The Same Location
ar: التسليم في موقع الاستلام

# dropOffLocation
source: Choose Drop Off Location
ar: اختر موقع التسليم

source: Search
ar: بحث

source: License ID
ar: صوره الرخصة

source: Edit Name
ar: تعديل الإسم

source: Edit Email
ar: تعديل البريد

source: Edit phone
ar: تعديل الهاتف

# newPassowrd
source: New Password
ar: كلمة المرور الجديدة

# addNewCard
source: Add Card
ar: إضافة بطاقة دفع

# emptyWallet
source: No Wallet Are Found
ar: لم يتم العثور على محفظة

source: Ongoing
ar: جاري

source: Completed
ar: مكتمل

source: Canceled
ar: ملغي

# continuePaymentProcess
source: Continue
ar: استكمال الحجز

source: Agree Terms And Conditions
ar: أوافق علي جميع الشروط والاحكام

# completeAccInfo
source: All required personal data must be entered To make a car reservation request.
ar: يجب إدخال جميع البيانات الشخصية المطلوبة؛للحصول علي تجربه مميزه.

source: Personal Data
ar: البيانات الشخصية

source: Birth Date
ar: تاريخ الميلاد

source: Nationality
ar: الجنسية

# address2
source: Address
ar: العنوان

source: End Date
ar: تاريخ الإنتهاء

# licenseIDNum
source: license ID Number
ar: رقم الرخصه

# coyNum
source: Version ID
ar: رقم النسخه

# licenceData
source: Personal card data / residence
ar: بيانات البطاقة الشخصية / الإقامة

# licence
source: Licence Data
ar: بيانات الرخصة

source: Save
ar: حفظ

source: Chauffeur Rent
ar: إيجار بسائق

# chauffeurDesc
source: We can assist you in streamlining your search for the top chauffeur-driven car so that you won't have to worry about anything.
ar: يمكننا مساعدتك في تبسيط بحثك عن أفضل سيارة يقودها سائق حتى لا تقلق بشأن أي شيء.

source: Self Drive Rent
ar: إيجار ذاتي القيادة

# selfDriveDesc
source: No need to deal with vehicle dealers or visit the auto dealership.Choose a Car.Confirm BookingKeys are in the vehicle, Enjoy Your Journey.
ar: لا حاجة للتعامل مع تجار السيارات أو زيارة وكيل السيارات.اختر سيارة.تأكيد الحجز.المفاتيح في السيارة ، استمتع برحلتك.

# tryButton
source: Try Now
ar: جرب الآن

# whoWeAreDesc
source: 4GO was founded in 2022 4GO is the largest E-car in KSA, where you can book any car you want, Without any interaction with humans. from the ground up.
ar: تأسست شركة 4GO في عام 2022 4GO هي أكبر شركة سيارات إلكترونية في المملكة العربية السعودية ، حيث يمكنك حجز أي سيارة تريدها ، دون أي تفاعل مع البشر. من الألف إلى الياء.

source: Our Vision
ar: رؤيتنا

# ourVisionDesc
source: Is to become the leading brand in the rental cars digital industry, to have the widest network of branches in GCC, and providing our clients with reliable services.
ar: أن نصبح العلامة التجارية الرائدة في صناعة تأجير السيارات الرقمية ، وأن يكون لدينا أكبر شبكة من الفروع في دول مجلس التعاون الخليجي ، وتزويد عملائنا بخدمات موثوقة.

source: Our Mission
ar: مهمتنا

# ourMissionDesc
source: Our mission is to offer the best car rental options in the Market, and make sure to get user satisfaction from the beginning to the end of the trip.
ar: مهمتنا هي تقديم أفضل خيارات تأجير السيارات في السوق ، والتأكد من الحصول على رضا المستخدم من بداية الرحلة إلى نهايتها.

source: Our Team
ar: فريقنا

# ourTeamDesc
source: Is composed of people with a variety of skills, abilities, and experiences working in a dynamic environment that promotes the sharing of their unique experience.
ar: يتألف من أشخاص يتمتعون بمجموعة متنوعة من المهارات والقدرات والخبرات في العمل في بيئة ديناميكية تعزز مشاركة تجربتهم الفريدة.

# work1
source: Log Into Your Account.
ar: تسجيل الدخول إلى حسابك

# work2
source: Choose Your Pick Up And Drop Off Details (Location / Date&Time).
ar: حدد التاريخ والوقت

# work3
source: Select Your Favorite Car.
ar: حدد سيارتك المفضلة

# work4
source: Pay With Your Credit Card.
ar: الدفع بواسطة بطاقة الائتمان

# work5
source: Go Get Your Car From your Choosen Pick up Location.
ar: اذهب واحصل على سيارتك من موقع الالتقاط الذي اخترته.

# work6
source: Scan The QR Code which you Can find on the windshield of the car.
ar: أمسح رمز الاستجابة السريعة

# work7
source: Take Images For Each Side Of The car.
ar: التقطت الصور للسيارة

# work8
source: Enjoy Your Trip.
ar: استمتع برحلتك

source: Policies
ar: سياسة الخصوصية

# foreword
source: 1- Foreword:
ar: ١- تمهيد:

# forewordDesc
source: This electronic portal for the 4GO Company for car rental (4GO CAR RENTAL) in the Kingdom of Saudi Arabia, which is referred to hereinafter as the 4GO application, is available for use by companies. In addition, and the customer's entry and use of this portal is subject to the terms and conditions of use of the application and the laws of the Kingdom of Saudi Arabia. Thus, his entry constitutes an unconditional approval of the terms and conditions of use of this portal, whether the user of the application is registered or not registered in the application. Moreover, this approval is effective from the date of his first use of this application, and any amendment to these terms and conditions becomes effective immediately after the amendment is made unless an indication otherwise is made by the customer, and it means that the customer continues to use this portal after any modification, his full acceptance of this modification.
ar: هذه البوابة الإلكترونية لشركة 4GO لتأجير السيارات (4GO CAR RENTAL) في المملكة العربية السعودية ، والتي يشار إليها فيما يلي باسم تطبيق 4GO ، متاحة للاستخدام من قبل الشركات. بالإضافة إلى ذلك ، يخضع دخول العميل واستخدامه لهذه البوابة لشروط وأحكام استخدام التطبيق وقوانين المملكة العربية السعودية. وبالتالي ، فإن دخوله يشكل موافقة غير مشروطة على شروط وأحكام استخدام هذه البوابة ، سواء كان مستخدم التطبيق مسجلاً أم غير مسجل في التطبيق. علاوة على ذلك ، فإن هذه الموافقة سارية المفعول من تاريخ أول استخدام له لهذا التطبيق ، وأي تعديل على هذه الشروط والأحكام يصبح ساري المفعول فور إجراء التعديل ما لم يشير العميل بخلاف ذلك ، وهذا يعني أن العميل مستمر لاستخدام هذه البوابة بعد أي تعديل ، موافقته الكاملة على هذا التعديل.

# rights
source: 2- Intellectual Property Rights:
ar: ٢- حقوق الملكية الفكرية:

# rightsDesc
source: The trade name of the company is the 4GO Company for Rent a Car Ltd., its trademark, the trademarks registered in its name, the company's electronic addresses, and all the materials, texts, pictures, graphics, circulars, forms, files, multimedia and software that the site contains, which is guaranteed by the system. It is not permitted to reprint, distribute, modify, or use these materials for any promotional or commercial purposes, or to republish them in any form without the express written permission of the 4GO Company for car rental (4GO CAR RENTAL).
ar: الاسم التجاري للشركة هو شركة 4GO لتأجير السيارات المحدودة وعلامتها التجارية والعلامات التجارية المسجلة باسمها والعناوين الإلكترونية للشركة وجميع المواد والنصوص والصور والرسومات والتعاميم والنماذج والملفات والوسائط المتعددة والبرمجيات التي يحتويها الموقع والتي يضمنها النظام. لا يجوز إعادة طبع هذه المواد أو توزيعها أو تعديلها أو استخدامها لأية أغراض ترويجية أو تجارية ، أو إعادة نشرها بأي شكل من الأشكال دون إذن كتابي صريح من شركة 4GO لتأجير السيارات (4GO CAR RENTAL).

# natureOfApp
source: 3- The Nature Of The App:
ar: ٣- طبيعة التطبيق:

# natureOfAppDesc
source: This application is considered the main application of the 4GO company that is directed to the corporate sector, and it provides the honorable visitors from this sector with basic information about the company and all the services it provides and its vision in providing its services, offers and discounts, and displays all the new developments in this regard.
ar: يعتبر هذا التطبيق التطبيق الرئيسي لشركة 4GO والموجه لقطاع الشركات ، ويوفر للزوار الكرام من هذا القطاع المعلومات الأساسية عن الشركة وجميع الخدمات التي تقدمها ورؤيتها في تقديم خدماتها وعروضها وخصائصها. خصومات ، ويعرض كل المستجدات في هذا الصدد.

# useOfApp
source: 4- Use Of The Application:
ar: ٤- استخدام التطبيق:

# useOfAppDesc
source: The company follows up the application and reviews it throughout the day to provide information to the customer about its services. The application also facilitates the communication process between customers and the company regarding any services or notes that may be of interest to the customer. The services and information contained in this application are directed and available for trading within the Kingdom of Saudi Arabia. These services have been provided in accordance with the laws and regulations of the Kingdom of Saudi Arabia related to the provision of such services. Accordingly, the customer may not be eligible to benefit from all the services received, and the company reserves the right to reject any request.
ar: تقوم الشركة بمتابعة التطبيق ومراجعته على مدار اليوم لتزويد العميل بمعلومات عن خدماته. يسهل التطبيق أيضًا عملية الاتصال بين العملاء والشركة فيما يتعلق بأي خدمات أو ملاحظات قد تهم العميل.الخدمات والمعلومات الواردة في هذا التطبيق موجهة ومتاحة للتداول داخل المملكة العربية السعودية. تم تقديم هذه الخدمات وفقًا لأنظمة وأنظمة المملكة العربية السعودية المتعلقة بتقديم هذه الخدمات. وفقًا لذلك ، قد لا يكون العميل مؤهلاً للاستفادة من جميع الخدمات التي يتلقاها ، وتحتفظ الشركة بالحق في رفض أي طلب.

# registrationMechanism
source: 5- Registration Mechanism:
ar: ٥- آلية التسجيل:

# registrationMechanismDesc
source: When registering on the company's website, the customer will be asked to write the user name and password that will be provided to the customer by the company's management, and an activation code will be sent to him when entering the application through the mobile registered and approved by the 4GO company to the customer. Pay attention that when the customer enters this information, besides the activation code sent by the company to his mobile phone approved by the 4GO company in the application, it is considered as an electronic signature and acceptance of electronic transactions and approval in addition to accepting the terms and conditions of using this application mentioned in the previous and subsequent clauses in this agreement.
ar: عند التسجيل في موقع الشركة ، سيُطلب من العميل كتابة اسم المستخدم وكلمة المرور اللذين سيتم توفيرهما للعميل من قبل إدارة الشركة ، وسيتم إرسال رمز التفعيل إليه عند دخول التطبيق من خلال الهاتف المحمول المسجل والمعتمد من شركة 4GO للعميل.انتبه إلى أنه عند قيام العميل بإدخال هذه المعلومات ، إلى جانب رمز التفعيل الذي أرسلته الشركة إلى هاتفه المحمول المعتمد من شركة 4GO في التطبيق ، فإنها تعتبر بمثابة توقيع إلكتروني وقبول المعاملات الإلكترونية والموافقة عليها بالإضافة إلى قبولها. شروط وأحكام استخدام هذا التطبيق المذكورة في البنود السابقة واللاحقة في هذه الاتفاقية.

# companyApp
source: 6- Company’s App:
ar: ٦- تطبيق الشركة:

# companyAppDesc
source: Any information or materials sent to the company via the internet through this application become the property of the 4GO Company for car rental (4GO CAR RENTAL), and it is known that the Internet still lacks comprehensive security. Consequently, the responsibility for any information via the Internet is limited to the customer who bears the risks related to that.
ar: تصبح أي معلومات أو مواد يتم إرسالها إلى الشركة عبر الإنترنت من خلال هذا التطبيق ملكًا لشركة 4GO لتأجير السيارات (4GO CAR RENTAL) ، ومن المعروف أن الإنترنت لا يزال يفتقر إلى الأمان الشامل. وبالتالي ، فإن المسؤولية عن أي معلومات عبر الإنترنت تقتصر على العميل الذي يتحمل المخاطر المتعلقة بذلك.

# disclaimers
source: 7- Disclaimers:
ar: ٧- إخلاء المسؤولية:

# disclaimersDesc
source: Whatever the case or circumstance, the company is not responsible for any of the following matters, including but not limited to: Negligence that causes any damages or damages of any kind, whether direct, incidental, special or subsequent, or any expenses or losses that may result due to the customer's use of this site or the inability to use it, or the occurrence of some errors or omissions, or the delay in the response of the system, (Due to a defect in the operating or communication systems), a hindrance in operation, malfunctions, exposure of computers to viruses, or a complete failure of the system, or loss of any profits, or the customer's reputation is subjected to damage even if an explicit notification is made of the possibility of such matters occurring, or the occurrence of problems because of Access to the site, enter it, use it, memorize it, or access through it to other sites.
ar: مهما كانت الحالة أو الظرف ، فإن الشركة ليست مسؤولة عن أي من الأمور التالية ، بما في ذلك على سبيل المثال لا الحصر: الإهمال الذي يتسبب في أي أضرار أو أضرار من أي نوع ، سواء كانت مباشرة أو عرضية أو خاصة أو لاحقة ، أو أي نفقات أو خسائر قد ينتج عن استخدام العميل لهذا الموقع أو عدم القدرة على استخدامه ، أو حدوث بعض الأخطاء أو السهو ، أو التأخير في استجابة النظام ، (بسبب خلل في أنظمة التشغيل أو الاتصال) ، إعاقة التشغيل ، أو الأعطال ، أو تعرض أجهزة الكمبيوتر للفيروسات ، أو الفشل التام للنظام ، أو فقدان أي أرباح ، أو تعرض سمعة العميل للضرر حتى إذا تم تقديم إشعار صريح بإمكانية حدوث مثل هذه الأمور ، أو حدوث مشكلات بسبب الدخول إلى الموقع أو الدخول إليه أو استخدامه أو حفظه أو الوصول من خلاله إلى مواقع أخرى.

# privacy
source: 8- Privacy:
ar: ٨- الخصوصية:

# privacyDesc
source: The company realizes the customer's need to know how to deal with his personal information. The company also realizes the extent of the concern that customers have in terms of privacy, confidentiality and security of the information that the customer provides via the Internet. The company reassures the customer in this regard that it is committed to preserving this information in the strictest of privacy and confidentiality. This permission represents the company's current policy on confidentiality and privacy, and the customer's use of the 4GO application and other company websites means acceptance of the terms and conditions, as well as this confidentiality and privacy statement.
ar: تدرك الشركة حاجة العميل إلى معرفة كيفية التعامل مع معلوماته الشخصية. كما تدرك الشركة مدى القلق الذي يساور العملاء من حيث الخصوصية والسرية والأمان للمعلومات التي يقدمها العميل عبر الإنترنت. وتطمئن الشركة العميل في هذا الصدد بأنها ملتزمة بالحفاظ على هذه المعلومات في أقصى درجات الخصوصية والسرية. يمثل هذا الإذن سياسة الشركة الحالية بشأن السرية والخصوصية ، واستخدام العميل لتطبيق 4GO ومواقع الشركة الأخرى يعني قبول الشروط والأحكام ، بالإضافة إلى بيان السرية والخصوصية هذا.

source: Terms & Conditions
ar: البنود و الشروط

# servicesPrices
source: 1- Providing Services And Prices:
ar: ١- تقديم الخدمات والأسعار:

# servicesPricesDesc
source: The client's use of the website and the service request is coupled with certain knowledge of the costs and fees of those services and all the information available about them, whether inside or outside the company's website. Furthermore, the customer's use of the site means acceptance of electronic bills and dealing with them with regard to bank and electronic payment, and the 4GO company does not bear any responsibility or financial claims because of that. The customer must view the prices of the cars offered and the value of the service provided by the company and make sure of their correctness, and when there is a mistake, the customer has the right to object to the company.
ar: يقترن استخدام العميل للموقع وطلب الخدمة بمعرفة معينة بتكاليف ورسوم تلك الخدمات وجميع المعلومات المتوفرة عنها سواء داخل أو خارج موقع الشركة. علاوة على ذلك ، فإن استخدام العميل للموقع يعني قبول الفواتير الإلكترونية والتعامل معها فيما يتعلق بالدفع المصرفي والإلكتروني ، ولا تتحمل شركة 4GO أي مسؤولية أو مطالبات مالية بسبب ذلك. يجب على العميل الاطلاع على أسعار السيارات المعروضة وقيمة الخدمة المقدمة من الشركة والتأكد من صحتها ، وعند حدوث خطأ يحق للعميل الاعتراض على الشركة.

# clientRequests
source: 2- Client Requests:
ar: ٢- طلبات العميل:

# clientRequestsDesc
source: (A) The Consequences Of Client Requests: The client authorizes the company to act according to requests that appear to be duly valid requests even if they are inconsistent with any other requests at any time regarding the requested services. (B) Implementation Of Instructions: Service requests received through the application will always be executed using the customer's password. (C) The failure Of The Other PartyThe company is not responsible for any failure on the part of the other party to implement the instructions or any delay or errors on the part of that party when implementing the instructions, whatever the reasons. (D) Accuracy And Completeness Of Instructions : The customer must ensure the accuracy and completeness of all the required data, and any incomplete data will not be accepted, and the customer shall be responsible for the errors resulting from the incomplete data. The 4GO Company for car rental (ABUDIYAB CAR RENTAL) will do everything in its power and use all its energies to fulfill the requests of its steemed clients.
ar: (أ) عواقب طلبات العملاء:يفوض العميل الشركة بالتصرف وفقًا للطلبات التي تبدو صحيحة حسب الأصول حتى لو كانت غير متوافقة مع أي طلبات أخرى في أي وقت بخصوص الخدمات المطلوبة. (ب) تنفيذ التعليمات:سيتم دائمًا تنفيذ طلبات الخدمة الواردة من خلال التطبيق باستخدام كلمة مرور العميل.(ج) فشل الطرف الآخر:الشركة غير مسؤولة عن أي تقصير من جانب الطرف الآخر في تنفيذ التعليمات أو أي تأخير أو أخطاء من جانب ذلك الطرف عند تنفيذ التعليمات مهما كانت الأسباب.(د) دقة واكتمال التعليمات:يجب على العميل التأكد من دقة واكتمال جميع البيانات المطلوبة ، ولن يتم قبول أي بيانات غير كاملة ، ويكون العميل مسؤولاً عن الأخطاء الناتجة عن البيانات غير المكتملة.ستبذل شركة 4GO لتأجير السيارات (ABUDIYAB CAR RENTAL) كل ما في وسعها وستستخدم كل طاقاتها لتلبية طلبات عملائها المحترمين.

# changesUpdates
source: 3- Changes and Updates:
ar: ٣- التغييرات والتحديثات:

# changesUpdatesDesc
source: The company has the right to change these terms and conditions or replace them entirely with other new terms and conditions, or replace a page or pages, which are contained on its websites on the Internet without notice. Furthermore, the customer's continued access to the company's website or use is considered as his approval of the changes that have taken place on the site as previously indicated. The company also has the right to modify the entire site or part of it, or suspend or suspend it temporarily or permanently without prior notice and at any time, it sees convenient.
ar: يحق للشركة تغيير هذه الشروط والأحكام أو استبدالها بالكامل بأحكام وشروط جديدة أخرى ، أو استبدال صفحة أو صفحات موجودة على مواقعها على الإنترنت دون إشعار. علاوة على ذلك ، يعتبر استخدام موقع الشركة أو استخدامها بمثابة موافقته على التغييرات التي حدثت على الموقع كما هو موضح سابقًا.كما يحق للشركة تعديل الموقع بأكمله أو جزء منه أو تعليقه أو تعليقه مؤقتًا أو بشكل دائم دون إشعار مسبق وفي أي وقت تراه مناسبًا.

# generalProvisions
source: 4- General Provisions:
ar: ٤- أحكام عامة:
