Repository: ashrafffathalla/taosel_user_APP
Catalog: lib/core/localization/app_*.arb
Languages: ar

# generalProvisionsDesc
source: (A) Applicable Law And Jurisdiction: This document is subject to the electronic transactions system, the information crime control system, and the transport and traffic authority system and is interpreted accordingly. Thus, the customer and the company agree to refer any dispute or dispute that may arise about these terms and conditions to the competent judicial authority. (B) The Reference In Case The Records Of the Two Parties Differ: In the event that the data provided by both parties differ, the final reference to the dispute is the data contained in the company's records at the time of contracting or submitting requests. (C) 25% (TWENTY-FIVE PERCENT) of the rental amount will be deducted if the reservation is canceled six hours or less before the appointment, in the event that the receipt or cancellation is not made after the reservation date. (D) The First Day Of Reservation Will Be Deducted, in the event that the identification documents (ID - driver's license) are not brought. (E) 25% (TWENTY-FIVE PERCENT) of the first day's rent will be deducted, in the event that the customer is unable to authorize (an expired license - suspension of services - failure to register or update data in the Absher system),one day's rent will be deducted 85%. (F) The rental value is calculated from the date and time specified by the customer in the reservation and not the actual time of receipt in case the customer arrives late. In the event that the customer arrives early, the actual time of receipt is calculated and not the time specified in the reservation. (G) According to the policy of the insurance company, in relation to the ages of the customer, if the customer is above 65 years old, he/she must accept one of the conditions below : 1- He/she must pay double amount of the deductible fees in case of an accident, according to the amount of the deductible fees for the type of rented car according to the insurance 2- The contract should be with CDW. * Terms And Conditions Of Hourly Rental Services: • Membership benefits cannot be used when requesting the service. • Pick-up from airport branches only and delivery at any branch. • (200) kilometers per day for all memberships. • The maximum service is (5 hours), and when the number of service hours is exceeded, a full day's rent is calculated.
ar: (أ) القانون الواجب التطبيق والاختصاص القضائي:تخضع هذه الوثيقة لنظام المعاملات الإلكترونية ونظام مكافحة جرائم المعلومات ونظام هيئة النقل والمرور ويتم تفسيرها على هذا الأساس. وبالتالي ، يوافق العميل والشركة على إحالة أي نزاع أو نزاع قد ينشأ حول هذه الشروط والأحكام إلى السلطة القضائية المختصة.(ب) المرجع في حالة السجلاتالفرق بين الطرفين:في حالة اختلاف البيانات المقدمة من الطرفين ، فإن المرجع النهائي للنزاع هو البيانات الواردة في سجلات الشركة وقت التعاقد أو تقديم الطلبات.(ج) سيتم خصم ٢٥٪ وخمسة وعشرون بالمائة من مبلغ الإيجار إذا تم إلغاء الحجز قبل ست ساعات أو أقل من الموعد ، في حالة عدم إجراء الإيصال أو الإلغاء بعد تاريخ الحجز.(د) سيتم خصم اليوم الأول من الحجز ، في حالة عدم إحضار وثائق الهوية (الهوية - رخصة القيادة) ،(هـ) سيتم خصم ٢٥٪ (خمسة وعشرون بالمائة) من إيجار اليوم الأول ، في حالة عدم قدرة العميل على التصريح (ترخيص منتهي الصلاحية - تعليق الخدمات - عدم التسجيل أو تحديث البيانات في نظام أبشر) ، سيتم خصم إيجار يوم واحد ٨٥٪ (=)،(و) يتم احتساب القيمة الإيجارية من التاريخ والوقت المحددين من قبل العميل في الحجز وليس وقت الاستلام الفعلي في حالة وصول العميل متأخرًا. في حالة وصول العميل مبكرًا ، يتم حساب وقت الاستلام الفعلي وليس الوقت المحدد في الحجز.(ز) وفقًا لسياسة شركة التأمين ، فيما يتعلق بأعمار العميل ، إذا كان العميل أكبر من ٦٥عامًا ، فيجب عليه / عليها قبول أحد الشروط التالية:١- يجب عليه دفع ضعف مبلغ الرسوم المقتطعة في حالة وقوع حادث ، حسب مبلغ الرسوم المقتطعة لنوع السيارة المستأجرة حسب التأمين.٢- يجب أن يكون العقد مع CDW. * شروط وأحكام التأجير بالساعةالخدمات:• لا يمكن الاستفادة من مزايا العضوية عند طلب الخدمة.• الاستلام من فروع المطار فقط والتسليم في أي فرع.• (٠ ٠ ٢) كيلو متر في اليوم لجميع العضويات.• الحد الأقصى للخدمة (٥ ساعات) ، وعند تجاوز عدد ساعات الخدمة يتم احتساب إيجار يوم كامل

# securityObligations
source: 5- The Client’s Security Obligations:
ar: ٥ -الالتزامات الأمنية للعميل:

# securityObligationsDesc
source: When registering on the company's website, the customer will be asked to write the user name and password that will be provided to the customer by the company's management, and an activation code will be sent to him when entering the application through the mobile registered and approved by the 4GO company to the customer. Pay attention that when the customer enters this information, besides the activation code sent by the company to his mobile phone approved by the 4GO company in the application, it is considered as an electronic signature and acceptance of electronic transactions and approval in addition to accepting the terms and conditions of using this application mentioned in the previous and subsequent clauses in this agreement.
ar: عند التسجيل في موقع الشركة ، سيُطلب من العميل كتابة اسم المستخدم وكلمة المرور اللذين سيتم توفيرهما للعميل من قبل إدارة الشركة ، وسيتم إرسال رمز التفعيل إليه عند دخول التطبيق من خلال الهاتف المحمول المسجل والمعتمد من شركة 4GO للعميل.انتبه إلى أنه عند قيام العميل بإدخال هذه المعلومات ، إلى جانب رمز التفعيل الذي أرسلته الشركة إلى هاتفه المحمول المعتمد من شركة 4GO في التطبيق ، فإنها تعتبر بمثابة توقيع إلكتروني وقبول المعاملات الإلكترونية والموافقة عليها بالإضافة إلى قبولها. شروط وأحكام استخدام هذا التطبيق المذكورة في البنود السابقة واللاحقة في هذه الاتفاقية.

# acknowledgment
source: 6- ACKNOWLEDGMENT OF KNOWLEDGE:
ar: ٦- الإقرار بالمعرفة:

# acknowledgmentDesc
source: The customer acknowledge that he has read these terms and conditions and abides by them without restriction, condition or reservation.
ar: يقر العميل بأنه قد قرأ هذه الشروط والأحكام ويلتزم بها دون قيد أو شرط أو تحفظ.

# address
source: Riyadh, Saudi Arabia
ar: الرياض, المملكة العربية السعودية

source: Info
ar: بيانات

source: Select Area
ar: حدد المنطقة

# q1
source: Can I cancel my reservation?
ar: هل يمكنني إلغاء حجز السيارة ؟

# a1
source: Yes, and it’s quite simple. You can cancel your reservation through your booking details after 2 hours from the booked time.
ar: نعم، يمكنك إلغاء الحجز من صفحة تفاصيل الحجز قبل إنتهاء ساعتين من وقت الحجز

# q2
source: Can someone else chauffeuring car for me during my booking?
ar: هل يمكن لغير من قام بالحجز قيادة السيارة؟

# a2
source: No only the person whose provided theire license.
ar: لا، يسمح فقط لمن قام بالحجز بقيادة السيارة

# q3
source: How will you refund your deposit?
ar: كيف يمكنني إستعادة مبلغ الحجز؟

# a3
source: We will refund your deposit to the credit card within at the same moment business days at the time of booking.
ar: يرسل لك قيمة مبلغ الحجز علي البطاقة الإتمانية التي استخدمتها في عملية الدفع

# q4
source: What about forgeting any personal belongings in the car?
ar: هل أستطيع إستعادة ممتلكاتي إذا نسيتها في السيارة بعد التسليم؟

# a4
source: 4Go does not take any responsibility for any of your belongings. However we suggest you to contact with us and we will try our best to help you.
ar: لا نتحمل مسؤولية أي ممتلكات مفقودة، ولكن يمكنك التواصل معنا وسوف نقوم بأفضل ما يمكننا لمساعدتك

# q5
source: Do I need to clean the car?
ar: هل أنا ملزم بنظافة السيارة؟

# a5
source: Yes , Incase you drop off car unclean you will pay a cleaning financial penalty, We recommand continous cleaning of car for your health & comfort
ar: نعم حفاظاً علي سلامتك نوصي دائماَ عملائنا بترك السيارة نظيفة دائما ، وفي حالة تسليم السيارة غير نظيفة سوف يطلب منك دفع غرامة مالية كرسوم تنظيف.

# q6
source: Is smoking allowed in the car?
ar: هل التدخين مسموح في السيارة؟

# a6
source: Smoking isn't allowed in the car, In case smoking you will pay a smoking financial penalty.
ar: لا يُسمح بالتدخين في السيارة، وفي حالة التدخين سيتم دفع غرامة مالية

source: Directions
ar: الاتجاهات

# qr
source: QR Code
ar: رمز الاستجابة

source: Car Name:
ar: اسم السيارة:

source: Car Number:
ar: رقم السيارة:

source: Color:
ar: اللون:

# scanQR
source: Scan QR Code
ar: مسح رمز الاستجابة

source: Add Payment
ar: إضافة بطاقة دفع

source: Name On The Card
ar: الإسم المدون على البطاقة

source: Card Number
ar: رقم البطاقة

source: Add
ar: إضافة

source: Location:
ar: العنوان:

source: Bags
ar: شنطة سيارة

# seats
source: 4 Seats
ar: 4 مقاعد

source: Door
ar: أبواب

source: Current Period:
ar: الفترة الحالية:

source: Hours
ar: ساعة

source: Day
ar: يوم

source: Minutes
ar: دقيقة

source: Book
ar: حجز

source: EG
ar: ج

# rate
source: Rates
ar: تقييمات

source: Not Completed
ar: غير مكتمل

source: Plate Number:
ar: رقم اللوحة:

# noPayment
source: We couldn't find any added payment methods, Please Add One to Continue.
ar: لم نتمكن من العثور على أي طرق دفع مضافة ، يرجى إضافة واحدة للمتابعة.

# pickUpLocations
source: Pick Up Location:
ar: موقع الاستلام:

source: Pick Up Time:
ar: توقيت الاستلام:

source: Pick Up Date:
ar: تاريخ الاستلام:

source: Booking Code:
ar: كود الحجز:

source: Booking Details:
ar: تفاصيل الحجز:

source: Pick Up Details
ar: تفاصيل الاستلام

source: Drop Off Details
ar: تفاصيل التسليم

# additionalServices
source: Additions
ar: اضافات

source: Full Insurance
ar: تكلفه التأمين الشامل

source: Shield
ar: درع

source: Extra Driver
ar: سائق إضافي

source: Value Added Tax:
ar: ضريبة القيمة المضافة:

source: Total:
ar: الإجمالي:

source: Next
ar: التالي

source: Payment Method
ar: طريقة الدفع

source: Change
ar: استبدال

# tax
source: Total With TAX:
ar: الإجمالي شامل الضريبة:

# bookDetails
source: Booking Details
ar: تفاصيل الحجز

source: View
ar: عرض

source: Download
ar: تحميل

source: Rental Value:
ar: قيمة الإيجار:

source: TAMM Fees
ar: رسوم تم

source: Cancel
ar: إلغاء

source: Pay Now
ar: إدفع الآن

# ourTime
source: Time:
ar: الوقت:

# listGarage
source: Garage List
ar: قائمة الحراجات

source: Map
ar: الخريطة

# deleteCredit
source: Delete Credit Card!
ar: حذف بطاقة الائتمان!

# deleteCreditDesc
source: Are You Sure You Want To Delete This Card?
ar: هل أنت متأكد أنك تريد حذف هذه البطاقة؟

source: Yes, Delete
ar: نعم
